ATS/app/views/employers/_employer_dropdown.html.haml

%div{:class => 'form-group'}
    = collection_select(:employment, :employer_id, Employer.all, :id, :name)
---
SELECT "employers".* FROM "employers" ORDER BY "employers"."name" ASC