ATS/app/controllers/employers_controller.rb

SELECT "employers".* FROM "employers"
---
    def index
        @employers = Employer.all

INSERT INTO "employers" ("name", "number", "email", "created_at", "updated_at", "contact_name") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ABC Software Developers"], ["number", ""], ["email", ""], ["created_at", "2020-04-06 16:29:59.207012"], ["updated_at", "2020-04-06 16:29:59.207012"], ["contact_name", ""]]
---
    def create
        @employer = Employer.create(employer_params)