ATS/app/controllers/students_controller.rb

def index

    @students = Student.students_in_department(session[:role_id])

    sort = params[:sort] || session[:sort]
    case sort
    when 'first_name'
      ordering,@first_name_header = :first_name_order, 'hilite'
    when 'last_name'
      ordering,@last_name_header = :last_name_order, 'hilite'
    when 'degree'
      ordering,@degree_header = :degree_name, 'hilite'
    when 'year_graduated'
      ordering,@year_graduated_header = :year_graduated, 'hilite'
    when 'season'
      ordering,@season_header = :season, 'hilite'
    end



    @earned_degrees = EarnedDegree.where(student_id: @students).sort_by(&ordering)
---
SELECT "earned_degrees".* FROM "earned_degrees" WHERE "earned_degrees"."student_id" IN (SELECT "students"."id" FROM "students")

def show
  @id = params[:id]
  @student = Student.find(@id)
  @addresses = Address.find_by(student_id: @id)
  @earned_degrees = @student.earned_degrees.order(:year_graduated)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."student_id" = ? LIMIT ?  [["student_id", 3], ["LIMIT", 1]]
SELECT "earned_degrees".* FROM "earned_degrees" WHERE "earned_degrees"."student_id" = ? ORDER BY "earned_degrees"."year_graduated" ASC  [["student_id", 3]]

def create
    @student = Student.create!(student_params)
    @addresses = Address.create!(addresses_params.merge({student_id: @student.id}))
    @earned_degree = EarnedDegree.create!(earned_degree_params.merge({student_id: @student.id}))
---
INSERT INTO "students" ("first_name", "middle_name", "last_name", "primary_email", "secondary_email", "cell_number", "work_number", "home_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "addresses" ("street_address", "city", "state", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["street_address", ""], ["city", ""], ["state", ""], ["student_id", 101], ["created_at", "2020-04-06 16:26:11.845082"], ["updated_at", "2020-04-06 16:26:11.845082"]]
INSERT INTO "earned_degrees" ("season", "year_graduated", "student_id", "degree_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["season", "Spring"], ["year_graduated", "2020"], ["student_id", 101], ["degree_id", 50], ["created_at", "2020-04-06 16:26:11.983579"], ["updated_at", "2020-04-06 16:26:11.983579"]]

  def edit
    id = params[:id]
    @student = Student.find(id)
    @addresses = Address.find_by(student_id: id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."student_id" = ? LIMIT ?  [["student_id", 3], ["LIMIT", 1]]

  def grad_school
    @id = params[:id]
    @student = Student.find(@id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]

  def employment
    @id = params[:id]
    @student = Student.find(@id)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]