ATS/app/controllers/students_details_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
  def add_grad_school
    @universities = University.all
    @student_id = params[:id]
    @name = Student.find(@student_id).first_name + " " + Student.find(@student_id).last_name

INSERT INTO "grad_schools" ("applied", "accepted", "status", "higher_degree_type", "higher_degree_name", "student_id", "university_id", "created_at", "updated_at", "graduated") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def submit_add_grad_school
    @id = params[:id]
    @grad_schools = GradSchool.create!(grad_schools_params.merge({student_id: @id}))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
  def add_employment
    @employers = Employer.all
    @id = params[:id]
    @name = Student.find(@id).first_name + " " + Student.find(@id).last_name

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
INSERT INTO "employments" ("job_title", "current_job", "in_field", "start_date", "end_date", "employer_id", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def submit_add_employment
    @id = params[:id]
    @student = Student.find(@id)
    @employment = Employment.create!(employment_params.merge({student_id: @id}))

SELECT  "employments".* FROM "employments" WHERE "employments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
---
  def edit_employment
    @id = params[:id]
    @employment = Employment.find(@id)
    @student_id = Student.find(@employment.student_id).id