ATS/app/controllers/universities_controller.rb

SELECT "universities".* FROM "universities"
---
    def index
        @universities = University.all

INSERT INTO "universities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Auburn University"], ["created_at", "2020-04-06 16:27:43.531497"], ["updated_at", "2020-04-06 16:27:43.531497"]]
---
    def create
        @university = University.create!(university_params)

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @university = University.find params[:id]

SELECT  "universities".* FROM "universities" WHERE "universities"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        @university = University.find params[:id]