ATS/app/controllers/welcome_controller.rb

  def index
    @role = Role.find_by_id(session[:role_id])
---
SELECT  "roles".* FROM "roles" WHERE "roles"."id" IS NULL LIMIT ?  [["LIMIT", 1]]