ATS/app/views/universities/_university_dropdown.html.haml

-#= select_tag 'id', options_for_select(@universities.collect{ |u| [u.name, u.id] })
= collection_select(:grad_schools, :university_id, University.all, :id, :name)
---
SELECT "universities".* FROM "universities" ORDER BY "universities"."name" ASC