ATS/app/views/students_details/_earned_degree.html.haml

    = label :earned_degree, :degree_id, 'Degree earned'
    = collection_select(:earned_degree, :degree_id, Degree.all.order(:name), :id, :name)
---
SELECT "degrees".* FROM "degrees" ORDER BY "degrees"."name" ASC