ATS/app/views/students_details/_grad_school_form.html.haml

SELECT "degree_types".* FROM "degree_types" ORDER BY "degree_types"."name" ASC
---
    = label :grad_schools, :higher_degree_type, 'Type'
    = collection_select(:grad_schools, :higher_degree_type, DegreeType.all.order(:name), :id, :name)